{
  "pages": [
    {
      "id": 0,
      "title": "",
      "content": "Hello Daniela, I wish you the best of luck as you work through the hints. After each hint, you will need to enter a password in order to progress to the next one. The hints will gradually become more challenging, so take your time with each step. I’m curious to see how far you’ll get and what you’ll think by the end. Until then, I’ll leave you to the journey—good luck, and I’ll be glad to hear about your progress later."
    },
    {
      "id": 1,
      "title": "The Quiet Bloom",
      "content": "There’s a softness that finds me whenever she drifts near— a warmth that rises without warning, as though the air itself shifts to remind me what joy is supposed to feel like. My practiced calm unravels in her presence, and something unguarded stirs— not loud, not dramatic, just honest in a way I rarely let myself be. It surprises me how natural it feels, how effortlessly she coaxes light from places I thought had long gone dim. And when she turns away, the quiet she leaves behind feels like missing something I never truly had."
    },
    {
      "id": 2,
      "title": "Where Small Joys Echo",
      "content": "Her voice brightens when she speaks of small joys— the kind that make the world feel warmer just by being mentioned. I find myself leaning in, memorizing the shape of her happiness, the way she glows over something simple, something cherished. There’s tenderness in how she loves, not loud or boastful, but steady— the sort of affection that softens even the hardest days. And in listening, I learn more than she knows— how gentle her heart is, and how easily it teaches mine to beat a little differently."
    },
    {
      "id": 3,
      "title": "A Warm-Hued Morning",
      "content": "Light seems to follow her— catching in the strands that fall across her shoulders, turning them golden at the edges, as though the sun pauses just to admire her. Her gaze holds a quiet depth, warm and earthy, like something the daylight rises just to touch. In those moments, everything else blurs— the world softens, time loosens its grip, and all that remains is the quiet way she turns toward the light, and the even quieter ache that settles in me whenever she does."
    },
    {
      "id": 4,
      "title": "The Softness in the Cracks",
      "content": "She speaks of her uncertainties as if they’re storms she must apologize for— small tempests she fears might send others running. But all they do is draw me nearer. There’s something delicate in the way she reveals her doubts, something that leaves a trace long after her words fade. She worries me— not in the way fear does, but the way beauty does: a fragile, aching pull that makes the heart hope it won’t break what it cherishes. Every flaw she fears only deepens the quiet longing she never meant to inspire."
    },
    {
      "id": 5,
      "title": "Purple Fortunes",
      "content": "She carries both strength and sweetness— a rare blend of bold spirit and gentle wonder. There’s a fierce grace in her, something steady and sure, as if she was shaped by a color deep enough to stand its ground. And then there’s the softness— small, bright flecks of hope that seem to follow her, bits of luck she never notices but always leaves behind. With her, the world feels a shade more vibrant, a touch more charmed— as though fate itself pauses to watch her walk by, dropping little blessings in her path and maybe, if I’m lucky, in mine too."
    },
    {
      "id": 6,
      "title": "",
      "content": "If you’ve made it to this point, then I’m fairly certain you already have an idea of who I like. There wasn’t really a need to take on the role of Sherlock Holmes when the entire situation could have been resolved with one simple question: “Angel, am I your crush?” Of course, I wouldn’t have given a direct or definite answer, but I definitely would have left you a series of clear hints to guide you. Still, reaching this far says a lot—maybe more than you realize. I’ve always had this slight feeling around you that never disappeared, yes I know how you feel about crushes especially because the people that had one on you where so we say a tad bit weird and also how you get embarrassed I honestly don’t know why the others feel for you probably for your looks I surly didn’t I feel for the girl who worries about the smallest things the one that can show her weakest side but still look strong I don’t think I’ve ever meet someone like that"
    }
  ]
}
